## Staging: ecs

**❌ &nbsp; Terraform Format:** `failure`
**✅ &nbsp; Terraform Plan:** `success`  


```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show Plan</summary>

```terraform
module.unmasked_metrics.aws_cloudwatch_log_group.log: Refreshing state... [id=/aws/ecs/unmasked_metrics_ecs]
aws_ecs_cluster.in_app_metrics: Refreshing state... [id=arn:aws:ecs:ca-central-1:005133826942:cluster/in-app-metrics]
module.masked_metrics.aws_cloudwatch_log_group.log: Refreshing state... [id=/aws/ecs/masked_metrics_ecs]
aws_iam_role.container_execution_role: Refreshing state... [id=container_execution_role]
aws_iam_role.task_execution_role: Refreshing state... [id=metrics_task_execution_role]
aws_iam_policy.etl_policies: Refreshing state... [id=arn:aws:iam::005133826942:policy/ETLTaskExecutionPolicies]
module.unmasked_metrics.aws_ecs_task_definition.task_def: Refreshing state... [id=unmasked_metrics]
module.masked_metrics.aws_ecs_task_definition.task_def: Refreshing state... [id=masked_metrics]
module.unmasked_metrics.aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:ca-central-1:005133826942:service/in-app-metrics/unmasked_metrics]
module.masked_metrics.aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:ca-central-1:005133826942:service/in-app-metrics/masked_metrics]
aws_iam_role_policy_attachment.te_etl_policies: Refreshing state... [id=metrics_task_execution_role-20210614163001316100000003]
aws_iam_role_policy_attachment.ce_cs: Refreshing state... [id=container_execution_role-20210614144933509400000001]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role.scheduled_task_cw_event_role will be created
  + resource "aws_iam_role" "scheduled_task_cw_event_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "etl-st-cw-role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.scheduled_task_cw_event_role_cloudwatch_policy will be created
  + resource "aws_iam_role_policy" "scheduled_task_cw_event_role_cloudwatch_policy" {
      + id     = (known after apply)
      + name   = "etl-st-cw-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ecs:RunTask"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::005133826942:role/metrics_task_execution_role"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.masked_metrics.aws_cloudwatch_event_rule.event_rule will be created
  + resource "aws_cloudwatch_event_rule" "event_rule" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "masked_metrics_event_rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "0 4 * * *"
      + tags                = {
          + "Name" = "masked_metrics-cw-event-rule"
        }
      + tags_all            = {
          + "Name" = "masked_metrics-cw-event-rule"
        }
    }

  # module.masked_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be created
  + resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
      + arn            = "arn:aws:ecs:ca-central-1:005133826942:cluster/in-app-metrics"
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = (known after apply)
      + rule           = "masked_metrics_event_rule"
      + target_id      = (known after apply)

      + ecs_target {
          + launch_type         = "FARGATE"
          + platform_version    = "1.4.0"
          + task_count          = 1
          + task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/masked_metrics:2"

          + network_configuration {
              + assign_public_ip = false
              + security_groups  = [
                  + "sg-090d16d17a0b6c2b1",
                ]
              + subnets          = [
                  + "subnet-02bfc21b518d54130",
                ]
            }
        }
    }

  # module.unmasked_metrics.aws_cloudwatch_event_rule.event_rule will be created
  + resource "aws_cloudwatch_event_rule" "event_rule" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "unmasked_metrics_event_rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "0 4 * * *"
      + tags                = {
          + "Name" = "unmasked_metrics-cw-event-rule"
        }
      + tags_all            = {
          + "Name" = "unmasked_metrics-cw-event-rule"
        }
    }

  # module.unmasked_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be created
  + resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
      + arn            = "arn:aws:ecs:ca-central-1:005133826942:cluster/in-app-metrics"
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = (known after apply)
      + rule           = "unmasked_metrics_event_rule"
      + target_id      = (known after apply)

      + ecs_target {
          + launch_type         = "FARGATE"
          + platform_version    = "1.4.0"
          + task_count          = 1
          + task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/unmasked_metrics:2"

          + network_configuration {
              + assign_public_ip = false
              + security_groups  = [
                  + "sg-090d16d17a0b6c2b1",
                ]
              + subnets          = [
                  + "subnet-02bfc21b518d54130",
                ]
            }
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary"
```
</details>